app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-07-09 06:06:19.131215"], ["updated_at", "2023-07-09 06:06:19.131215"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "quantity", "order_id") VALUES (?, ?, ?, ?, ?, ?)  [["product_id", 2], ["cart_id", 44], ["created_at", "2023-07-10 09:58:18.326795"], ["updated_at", "2023-07-10 09:58:18.326795"], ["quantity", 1], ["order_id", nil]]
UPDATE "line_items" SET "updated_at" = ?, "quantity" = ? WHERE "line_items"."id" = ?  [["updated_at", "2023-07-10 07:12:57.554016"], ["quantity", 2], ["id", 4]]
---
  def create
    product = Product.find(params[:product_id])

    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save

UPDATE "line_items" SET "cart_id" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["cart_id", 3], ["updated_at", "2023-07-09 08:03:26.857828"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @line_item.update(line_item_params)