app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."name" ASC
---
  def index
    @users = User.order(:name)

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "ismail"], ["password_digest", "[FILTERED]"], ["created_at", "2023-07-11 08:36:40.981109"], ["updated_at", "2023-07-11 08:36:40.981109"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save