app/models/order.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 51]]
---
  def add_line_items_from_cart(cart)
    cart.line_items.each do |item|